---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d.GetValueAsXYZ
source: html/1cd17e63-c80f-0fd3-501a-ae40ed8a72b0.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d.GetValueAsXYZ Method

Get the value property as a vector or point XYZ.

## Syntax (C#)
```csharp
public XYZ GetValueAsXYZ()
```